In [1]:
# a basic panda library based function
import pandas as pd
import numpy as np
ser = pd.Series()
print(ser)
data = np.array(['g','e','e','k','s'])
ser = pd.Series(data)
print(ser)

df = pd.DataFrame()
lst = ['Geeks','for','geeks','is','portal','for','geeks']
df = pd.DataFrame(lst)
print(df)

Series([], dtype: float64)
0    g
1    e
2    e
3    k
4    s
dtype: object
        0
0   Geeks
1     for
2   geeks
3      is
4  portal
5     for
6   geeks

In [17]:
# creating dataframes from list of list
import pandas as pd
data = {'Name':['tom','nick','krish','jack'],'Age':[20,21,19,18]}
df = pd.DataFrame(data,index =['rank1 ','rank2','rank3','rank4'])
print(df)

         Name  Age
rank1     tom   20
rank2    nick   21
rank3   krish   19
rank4    jack   18

In [18]:
# creating dataframes from dictonary
import pandas as pd
data = {'Name':['tom','jack','nick','juli'],'marks':[99,98,95,90]}
df = pd.DataFrame(data,index = ['rank1','rank2','rank3','rank4'])
print(df)

       Name  marks
rank1   tom     99
rank2  jack     98
rank3  nick     95
rank4  juli     90

In [21]:
# creating dataframes from list of dictonary
import pandas as pd
data = [{'a':1,'b':2},{'a':10,'b':20,'c':30}]
df1 = pd.DataFrame(data,index = ['rank1','rank2'],columns = ['a','b'])
df2 = pd.DataFrame(data,index = ['rank1','rank2'],columns = ['a','b1'])
print(df1,"\n")
print(df2)

        a   b
rank1   1   2
rank2  10  20

        a  b1
rank1   1 NaN
rank2  10 NaN

In [24]:
# creating Datframe from zip() function
# two lists can be merged using zip command
import pandas as pd
Name = ['tom','krish','nick','juli']
Age = [25,30,26,22]
list_of_tuples = list(zip(Name,Age)) 
df = pd.DataFrame(list_of_tuples,columns = ['Name','Age'])

df

    Name  Age
0    tom   25
1  krish   30
2   nick   26
3   juli   22

In [25]:
# creating Dataframes from dict of series
import pandas as pd
d = {'one' : pd.Series([10,20,30,40],index = ['a','b','c','d']),
    'two': pd.Series([10,20,30,40],index = ['a','b','c','d'])}
df = pd.DataFrame(d)
df

   one  two
a   10   10
b   20   20
c   30   30
d   40   40

In [30]:
# a short sweet progra in series
import pandas as pd 
import numpy as np
data = np.array(['a','d','f','g','h','j','e','r','t','y','u'])

ser = pd.Series(data)

print(ser[3:5])

3    g
4    h
dtype: object

In [39]:
data = pd.Series([5,2,3,7],index = ['a','b','c','d'])
data1 = pd.Series([2,3,5,6],index = ['a','b','c','d'])
print(data.add(data1,fill_value = 0))
data.sub(data1,fill_value = 0)

a     7
b     5
c     8
d    13
dtype: int64

a    3
b   -1
c   -2
d    1
dtype: int64

In [2]:
data = pd.read_csv("https://media.geeksforgeeks.org/wp-content/uploads/nba.csv")

In [3]:
data_top = data.head() 
  
# display 
data_top

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0
4,Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,NaN,5000000.0

In [3]:
import socket

mysock = socket.socket(socket.AF_INET,socket.SOCK_STREAM)
mysock.connect(('data.pr4e.org',80))
cmd = 'GET http://data.pr4e.org/romeo.txt HTTP/1.0\n\n'.encode()
mysock.send(cmd)


while True:
    data = mysock.recv(512)
    if(len(data) < 1):
        break
    print(data.decode())
mysock.close()

HTTP/1.1 400 Bad Request
Date: Sat, 12 Sep 2020 13:42:47 GMT
Server: Apache/2.4.18 (Ubuntu)
Content-Length: 308
Connection: close
Content-Type: text/html; charset=iso-8859-1

<!DOCTYPE HTML PUBLIC "-//IETF//DTD HTML 2.0//EN">
<html><head>
<title>400 Bad Request</title>
</head><body>
<h1>Bad Request</h1>
<p>Your browser sent a request that this server could not understand.<br />
</p>
<hr>
<address>Apache/2.4.18 (Ubuntu) Server at do1.dr-chuck.com Port 80</address>
</body></html>